results/slo-fail-300vu-pass.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/slo-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 300 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 300/300 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 300 VUs  01.0s/30s

running (0m02.0s), 300/300 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 300 VUs  02.0s/30s

running (0m03.0s), 300/300 VUs, 127 complete and 0 interrupted iterations
default   [  10% ] 300 VUs  03.0s/30s

running (0m04.0s), 300/300 VUs, 386 complete and 0 interrupted iterations
default   [  13% ] 300 VUs  04.0s/30s

running (0m05.0s), 300/300 VUs, 556 complete and 0 interrupted iterations
default   [  17% ] 300 VUs  05.0s/30s

running (0m06.0s), 300/300 VUs, 791 complete and 0 interrupted iterations
default   [  20% ] 300 VUs  06.0s/30s

running (0m07.0s), 300/300 VUs, 995 complete and 0 interrupted iterations
default   [  23% ] 300 VUs  07.0s/30s

running (0m08.0s), 300/300 VUs, 1276 complete and 0 interrupted iterations
default   [  27% ] 300 VUs  08.0s/30s

running (0m09.0s), 300/300 VUs, 1454 complete and 0 interrupted iterations
default   [  30% ] 300 VUs  09.0s/30s

running (0m10.0s), 300/300 VUs, 1710 complete and 0 interrupted iterations
default   [  33% ] 300 VUs  10.0s/30s

running (0m11.0s), 300/300 VUs, 1893 complete and 0 interrupted iterations
default   [  37% ] 300 VUs  11.0s/30s

running (0m12.0s), 300/300 VUs, 2191 complete and 0 interrupted iterations
default   [  40% ] 300 VUs  12.0s/30s

running (0m13.0s), 300/300 VUs, 2354 complete and 0 interrupted iterations
default   [  43% ] 300 VUs  13.0s/30s

running (0m14.0s), 300/300 VUs, 2610 complete and 0 interrupted iterations
default   [  47% ] 300 VUs  14.0s/30s

running (0m15.0s), 300/300 VUs, 2777 complete and 0 interrupted iterations
default   [  50% ] 300 VUs  15.0s/30s

running (0m16.0s), 300/300 VUs, 3068 complete and 0 interrupted iterations
default   [  53% ] 300 VUs  16.0s/30s

running (0m17.0s), 300/300 VUs, 3345 complete and 0 interrupted iterations
default   [  57% ] 300 VUs  17.0s/30s

running (0m18.0s), 300/300 VUs, 3498 complete and 0 interrupted iterations
default   [  60% ] 300 VUs  18.0s/30s

running (0m19.0s), 300/300 VUs, 3674 complete and 0 interrupted iterations
default   [  63% ] 300 VUs  19.0s/30s

running (0m20.0s), 300/300 VUs, 3963 complete and 0 interrupted iterations
default   [  67% ] 300 VUs  20.0s/30s

running (0m21.0s), 300/300 VUs, 4234 complete and 0 interrupted iterations
default   [  70% ] 300 VUs  21.0s/30s

running (0m22.0s), 300/300 VUs, 4422 complete and 0 interrupted iterations
default   [  73% ] 300 VUs  22.0s/30s

running (0m23.0s), 300/300 VUs, 4671 complete and 0 interrupted iterations
default   [  77% ] 300 VUs  23.0s/30s

running (0m24.0s), 300/300 VUs, 4835 complete and 0 interrupted iterations
default   [  80% ] 300 VUs  24.0s/30s

running (0m25.0s), 300/300 VUs, 5102 complete and 0 interrupted iterations
default   [  83% ] 300 VUs  25.0s/30s

running (0m26.0s), 300/300 VUs, 5272 complete and 0 interrupted iterations
default   [  87% ] 300 VUs  26.0s/30s

running (0m27.0s), 300/300 VUs, 5543 complete and 0 interrupted iterations
default   [  90% ] 300 VUs  27.0s/30s

running (0m28.0s), 300/300 VUs, 5733 complete and 0 interrupted iterations
default   [  93% ] 300 VUs  28.0s/30s

running (0m29.0s), 300/300 VUs, 5973 complete and 0 interrupted iterations
default   [  97% ] 300 VUs  29.0s/30s

running (0m30.0s), 300/300 VUs, 6166 complete and 0 interrupted iterations
default   [ 100% ] 300 VUs  30.0s/30s

running (0m31.0s), 063/300 VUs, 6403 complete and 0 interrupted iterations
default ↓ [ 100% ] 300 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<408' p(95)=236.85ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6466    202.541872/s
    checks_succeeded...: 100.00% 6466 out of 6466
    checks_failed......: 0.00%   0 out of 6466

    ✓ status 200

    HTTP
    http_req_duration..............: avg=173.11ms min=58.23ms med=219.37ms max=2.21s p(90)=232.87ms p(95)=236.85ms
      { expected_response:true }...: avg=173.11ms min=58.23ms med=219.37ms max=2.21s p(90)=232.87ms p(95)=236.85ms
    http_req_failed................: 0.00%  0 out of 12932
    http_reqs......................: 12932  405.083745/s

    EXECUTION
    iteration_duration.............: avg=1.42s    min=1.28s   med=1.31s    max=5.48s p(90)=1.33s    p(95)=2.34s   
    iterations.....................: 6466   202.541872/s
    vus............................: 63     min=63         max=300
    vus_max........................: 300    min=300        max=300

    NETWORK
    data_received..................: 26 MB  823 kB/s
    data_sent......................: 1.6 MB 51 kB/s



running (0m31.9s), 000/300 VUs, 6466 complete and 0 interrupted iterations
default ✓ [ 100% ] 300 VUs  30s