results/slo-fail.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/slo-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  01.0s/30s

running (0m02.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  02.0s/30s

running (0m03.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  03.0s/30s

running (0m04.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  04.0s/30s

running (0m05.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  05.0s/30s

running (0m06.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  06.0s/30s

running (0m07.0s), 1000/1000 VUs, 6 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  07.0s/30s

running (0m08.0s), 1000/1000 VUs, 13 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  08.0s/30s

running (0m09.0s), 1000/1000 VUs, 33 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  09.0s/30s

running (0m10.0s), 1000/1000 VUs, 67 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  10.0s/30s

running (0m11.0s), 1000/1000 VUs, 105 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  11.0s/30s

running (0m12.0s), 1000/1000 VUs, 160 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  12.0s/30s

running (0m13.0s), 1000/1000 VUs, 207 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  13.0s/30s

running (0m14.0s), 1000/1000 VUs, 276 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  14.0s/30s

running (0m15.0s), 1000/1000 VUs, 357 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  15.0s/30s

running (0m16.0s), 1000/1000 VUs, 447 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  16.0s/30s

running (0m17.0s), 1000/1000 VUs, 527 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  17.0s/30s

running (0m18.0s), 1000/1000 VUs, 630 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  18.0s/30s

running (0m19.0s), 1000/1000 VUs, 730 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  19.0s/30s

running (0m20.0s), 1000/1000 VUs, 850 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  20.0s/30s

running (0m21.0s), 1000/1000 VUs, 951 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  21.0s/30s

running (0m22.0s), 1000/1000 VUs, 1099 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  22.0s/30s

running (0m23.0s), 1000/1000 VUs, 1208 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  23.0s/30s

running (0m24.0s), 1000/1000 VUs, 1335 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  24.0s/30s

running (0m25.0s), 1000/1000 VUs, 1471 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  25.0s/30s

running (0m26.0s), 1000/1000 VUs, 1600 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  26.0s/30s

running (0m27.0s), 1000/1000 VUs, 1776 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  27.0s/30s

running (0m28.0s), 1000/1000 VUs, 1936 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  28.0s/30s

running (0m29.0s), 1000/1000 VUs, 2100 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  29.0s/30s

running (0m30.0s), 1000/1000 VUs, 2278 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  30.0s/30s

running (0m31.0s), 0843/1000 VUs, 2438 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m32.0s), 0623/1000 VUs, 2658 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m33.0s), 0505/1000 VUs, 2776 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m34.0s), 0453/1000 VUs, 2828 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m35.0s), 0251/1000 VUs, 3030 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m36.0s), 0217/1000 VUs, 3064 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m37.0s), 0196/1000 VUs, 3085 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m38.0s), 0183/1000 VUs, 3098 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m39.0s), 0142/1000 VUs, 3139 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m40.0s), 0131/1000 VUs, 3150 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m41.0s), 0111/1000 VUs, 3170 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m42.0s), 0110/1000 VUs, 3171 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m43.0s), 0107/1000 VUs, 3174 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m44.0s), 0107/1000 VUs, 3174 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m45.0s), 0103/1000 VUs, 3178 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m46.0s), 0101/1000 VUs, 3180 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m47.0s), 0094/1000 VUs, 3187 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m48.0s), 0084/1000 VUs, 3197 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m49.0s), 0083/1000 VUs, 3198 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m50.0s), 0083/1000 VUs, 3198 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m51.0s), 0082/1000 VUs, 3199 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m52.0s), 0070/1000 VUs, 3211 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m53.0s), 0068/1000 VUs, 3213 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m54.0s), 0064/1000 VUs, 3217 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m55.0s), 0051/1000 VUs, 3230 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m56.0s), 0051/1000 VUs, 3230 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m57.0s), 0050/1000 VUs, 3231 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m58.0s), 0050/1000 VUs, 3231 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m59.0s), 0038/1000 VUs, 3243 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (1m00.0s), 0034/1000 VUs, 3247 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<408' p(95)=4.48s

    http_req_failed
    ✗ 'rate<0.01' rate=4.52%


  █ TOTAL RESULTS 

    checks_total.......: 3258   54.297467/s
    checks_succeeded...: 91.16% 2970 out of 3258
    checks_failed......: 8.83%  288 out of 3258

    ✗ status 200
      ↳  91% — ✓ 2970 / ✗ 288

    HTTP
    http_req_duration..............: avg=1.28s  min=0s      med=529.15ms max=30.19s p(90)=2.55s  p(95)=4.48s 
      { expected_response:true }...: avg=1.28s  min=54.81ms med=601.42ms max=30.19s p(90)=2.6s   p(95)=4.48s 
    http_req_failed................: 4.52%  288 out of 6371
    http_reqs......................: 6371   106.17838/s

    EXECUTION
    iteration_duration.............: avg=10.29s min=1.27s   med=2.95s    max=59.04s p(90)=33.98s p(95)=35.74s
    iterations.....................: 3247   54.114142/s
    vus............................: 34     min=34          max=1000
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 19 MB  313 kB/s
    data_sent......................: 3.2 MB 53 kB/s



running (1m00.0s), 0000/1000 VUs, 3247 complete and 34 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s